import os
from dotenv import load_dotenv

load_dotenv()

VETMANAGER_URL = os.environ["VETMANAGER_URL"]
API_KEY = os.environ["API_KEY"]
SERVICE_NAME = os.getenv("SERVICE_NAME", "Getein_Lab")

# ================================================================
# КОНФИГУРАЦИЯ ПОРТОВ
# Все порты запускаются и слушаются одновременно
# ================================================================

DEVICES_CONFIG = {
    5001: {
        "name": "Getein 1160",
        "lab_code": "ИФА"
    },
    5002: {
        "name": "Getein GN 7000 (PCR)",
        "lab_code": "ПЦР"
    },
    5003: {
        "name": "Ozelle Vet BHA-5000",
        "lab_code": "МФВА"
    },
    5004: {
        "name": "Biochemistry Analyzer",
        "lab_code": "БИОХИМИЯ"
    },
    5005: {
        "name": "Ozelle EHVT-75",
        "lab_code": "МФВА"
    },
    5006: {
        "name": "Lockmedt Biochemistry Analyzer",
        "lab_code": "Биохимический анализ крови",
        "unframed_hl7": True,
    },
}


# ================================================================
# НАЗВАНИЯ АНАЛИЗОВ
# ================================================================

def translate(name, mapping):
    return mapping.get(name, name)


test_names_ru = {
    "WBC": "Лейкоциты (WBC)",
    "RBC": "Эритроциты (RBC)",
    "HGB": "Гемоглобин (Hb, HGB)",
    "HCT": "Гематокрит (Ht, HCT)",
    "MCV": "Средний объем эритроцита (MCV)",
    "MCH": "Среднее содержание гемоглобина в эритроците (MCH)",
    "MCHC": "Средняя концентрация гемоглобина в эритроците (MCHC)",
    "RDW-CV": "Показатель анизоцитоза эритроцитов (RDW-CV)",
    "RDW-SD": "Ширина распределения эритроцитов по объему (RDW-SD)",
    "HDW-CV": "Ширина распределения гемоглобина, CV (HDW-CV)",
    "HDW-SD": "Ширина распределения гемоглобина, SD (HDW-SD)",

    "PLT": "Тромбоциты (PLT)",
    "PCT": "Тромбокрит (PCT)",
    "MPV": "Средний объем тромбоцитов (MPV)",
    "PDW": "Ширина распределения тромбоцитов по объему (PDW)",
    "P-LCC": "Количество крупных тромбоцитов (P-LCC)",
    "P-LCR": "Доля крупных тромбоцитов (P-LCR)",

    "NEU#": "Нейтрофилы, абсолютное количество (NEU#)",
    "NEU%": "Нейтрофилы (NEU)",

    "NST#": "Палочкоядерные нейтрофилы, абсолютное количество (NST#)",
    "NST/WBC%": "Палочкоядерные нейтрофилы (% от WBC)",
    "NST/NEU%": "Палочкоядерные нейтрофилы (% от NEU)",

    "NSG#": "Сегментоядерные нейтрофилы, абсолютное количество (NSG#)",
    "NSG%": "Сегментоядерные нейтрофилы (%)",

    "NSH#": "Гиперсегментоядерные нейтрофилы, абсолютное количество (NSH#)",
    "NSH/WBC%": "Гиперсегментоядерные нейтрофилы (% от WBC)",
    "NSH/NEU%": "Гиперсегментоядерные нейтрофилы (% от NEU)",

    "LYM#": "Лимфоциты, абсолютное количество (LYMPH#)",
    "LYM%": "Лимфоциты (LYMPH)",

    "SLYM#": "Малые лимфоциты, абсолютное количество (SLYM#)",
    "SLYM%": "Малые лимфоциты (SLYM)",

    "LLYM#": "Большие лимфоциты, абсолютное количество (LLYM#)",
    "LLYM%": "Большие лимфоциты (LLYM)",

    "MON#": "Моноциты, абсолютное количество (MONO#)",
    "MON%": "Моноциты (MONO)",

    "EOS#": "Эозинофилы, абсолютное количество (EOSIN#)",
    "EOS%": "Эозинофилы (EOSIN)",

    "BAS#": "Базофилы, абсолютное количество (BASOF#)",
    "BAS%": "Базофилы (BASOF)",

    "AWBC#": "Атипичные лейкоциты, абсолютное количество (AWBC#)",

    "RET#": "Ретикулоциты, абсолютное количество (RET#)",
    "RET%": "Ретикулоциты (%)",

    "ETG#": "Эритроциты-тени, абсолютное количество (ETG#)",
    "ETG%": "Эритроциты-тени (%)",

    "SPH#": "Сфероциты, абсолютное количество (SPH#)",
    "SPH%": "Сфероциты (%)",

    "ACA#": "Акантоциты, абсолютное количество (ACA#)",

    "NRBC#": "Ядросодержащие эритроциты, абсолютное количество (NRBC#)",
    "NRBC/WBC%": "Ядросодержащие эритроциты (% от WBC)",

    "AGG#": "Агглютинированные эритроциты, абсолютное количество (AGG#)",

    "HEB#": "Тельца Хайнца, абсолютное количество (HEB#)",
    "HEB%": "Тельца Хайнца (%)",

    "APLT#": "Агрегаты тромбоцитов, абсолютное количество (APLT#)",

    "fSAA": "Сывороточный амилоид А кошек(fSAA)",
    "сSAA": "Сывороточный амилоид А собак(сSAA)",

    "TXE": "Общие элементы (TXE)",
    "NANE": "Не классифицированные элементы (NANE)",
    "NCEE": "Плоский эпителий (NCEE)",
    "NDIP": "Дизморфные эритроциты (NDIP)",
    "NSPI": "Сперматозоиды / Круглые клетки (NSPI)",
    "NTtE": "Переходный эпителий (NTtE)",
    "NTRE": "Почечный эпителий (NTRE)",
    "NTRI": "Трихомонады / Инфекционные агенты (NTRI)",
    "NGIA": "Гигантские клетки / Элементы слизи (NGIA)",
    "NCOD": "Кристаллы (NCOD)",
    "NCOD0": "Кристаллы тип 0 (NCOD0)",
    "NCOD1": "Кристаллы тип 1 (NCOD1)",
    "NCOD2": "Кристаллы тип 2 (NCOD2)",
    "NTg": "Зернистые структуры / Жировые включения (NTg)",
    "NCOS": "Цилиндры (NCOS)",
    "HBACI": "Бактерии (HBACI)",
    "NC/B": "Соотношение цилиндров и бактерий (NC/B)",
    "HCAM": "Кристаллы кальция (HCAM)",
    "NBAC": "Бациллы (NBAC)",
    "NSS1": "Специальные структуры 1 (NSS1)",
    "NSS2": "Специальные структуры 2 (NSS2)",
    "NYEA": "Дрожжевые грибки (NYEA)",
    "NRBC": "Эритроциты (NRBC)",
    "NWBC": "Лейкоциты (NWBC)",
    "NEPC": "Эпителиальные клетки (NEPC)",
    "NSTA": "Сперматозоиды (NSTA)",
    "NLFAT": "Липиды / Жировые капли (NLFAT)",
    "NPLA": "Цилиндроиды / Нити слизи (NPLA)",
    "NAF": "Аморфные фосфаты / Артефакты (NAF)",

    "ALB": "Альбумин (ALB)",
    "TP": "Общий белок (TP)",
    "GLOB": "Глобулин (GLOB)",
    "A/G": "Альбумин-глобулиновый коэффициент (A/G)",
    "ALP": "Щелочная фосфатаза (ALP)",
    "ALT": "Аланинаминотрансфераза / АЛТ (ALT)",
    "AST": "Аспартатаминотрансфераза / АСТ (AST)",
    "AST/ALT": "Соотношение АСТ/АЛТ / Коэффициент Де Ритиса (AST/ALT)",
    "BUN": "Азот мочевины крови / Мочевина (BUN)",
    "CRE": "Креатинин (CRE)",
    "BUN/CRE": "Соотношение мочевины и креатинина (BUN/CRE)",
    "CK": "Креатинкиназа / КФК (CK)",
    "LDH": "Лактатдегидрогеназа / ЛДГ (LDH)",
    "GLU": "Глюкоза (GLU)"
}

pcr_names_ru = {
    "FCoV": "Коронавирус кошек (FCoV)",
    "FPV": "Вирус панлейкопении кошек (FPV)",
    "TF": "Tritrichomonas foetus (TF)",
    "GL": "Giardia lamblia (GL)",
    "MF": "Микоплазмоз (MF)",
    "CF": "Хламидиоз (CF)",
    "Bb": "Бордетеллез (Bb)",
    "FeLV": "Вирусная лейкемия кошек (FeLV)",
    "FIV": "Вирус иммунодефицита кошек (FIV)",
    "FCoV Ag": "Антиген коронавируса кошек (FCoV Ag)",
    "CIV": "Вирус гриппа собак (CIV)",
    "CCoV Ag": "Антиген коронавируса собак (CCoV Ag)",

}

BHA_ANALYSIS_NAMES = {
    "Fecal Occult Blood Test": "Анализ кала на скрытую кровь",
    "Complete Blood Count": "Общий анализ крови",
    "Fecal Microbial Analysis": "Общий анализ кала_",
    "Faecal Microbial Analysis": "Общий анализ кала",
}
